Repository: Eduard047/GymApp
Catalog: ios/GymApp-iOS/GymApp/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uk

source: The account changed while the request was running. Try again.
ru: Учётная запись изменилась во время выполнения запроса. Попробуй ещё раз.
uk: Обліковий запис змінився під час виконання запиту. Спробуй ще раз.

source: The account storage key is empty or too long.
ru: Ключ хранилища аккаунта пуст или слишком длинный.
uk: Ключ сховища акаунта порожній або надто довгий.

source: The backup is invalid: The document is not UTF-8 JSON.
ru: Резервная копия некорректна: документ не является JSON в кодировке UTF-8.
uk: Резервна копія некоректна: документ не є JSON у кодуванні UTF-8.

source: The cloud returned an invalid response.
ru: Облако вернуло некорректный ответ.
uk: Хмара повернула некоректну відповідь.

source: The cloud returned an invalid response. Try again.
ru: Облако вернуло некорректный ответ. Попробуй еще раз.
uk: Хмара повернула некоректну відповідь. Спробуй ще раз.

source: The confirmation link did not contain a valid session.
ru: Ссылка на подтверждение не содержит действительной сессии.
uk: Посилання підтвердження не містить дійсної сесії.

source: The current month is already selected
ru: Текущий месяц уже выбран
uk: Поточний місяць уже вибрано

source: The document is not UTF-8 JSON.
ru: Документ не является JSON в кодировке UTF-8.
uk: Документ не є JSON у кодуванні UTF-8.

source: The exercise entry no longer exists in this workout.
ru: Записи этого упражнения больше нет в тренировке.
uk: Запису цієї вправи більше немає в тренуванні.

source: The exercise is used by saved workouts.
ru: Упражнение использовано в сохраненных тренировках.
uk: Вправу використано у збережених тренуваннях.

source: The exercise no longer exists.
ru: Этого упражнения больше не существует.
uk: Цієї вправи більше не існує.

source: The exercise or its linked workout data changed before deletion. Review it and try again.
ru: Упражнение или связанные с ним данные тренировок изменились перед удалением. Проверь их и попробуй ещё раз.
uk: Вправа або пов’язані з нею дані тренувань змінилися перед видаленням. Перевір їх і спробуй ще раз.

source: The exercise will be permanently deleted. Linked impact: %1$@; %2$@; empty workouts deleted: %3$@. This cannot be undone.
ru: Упражнение будет удалено навсегда. Связанные данные: %1$@; %2$@; пустых тренировок будет удалено: %3$@. Это действие нельзя отменить.
uk: Вправу буде остаточно видалено. Пов’язані дані: %1$@; %2$@; порожніх тренувань буде видалено: %3$@. Цю дію не можна скасувати.

source: The Garmin sync request is too large or malformed.
ru: Запрос синхронизации Garmin слишком большой или некорректный.
uk: Запит синхронізації Garmin завеликий або некоректний.

source: The Garmin watch selection could not be stored securely, so its one-time token was not shown.
ru: Не удалось безопасно сохранить выбор часов Garmin, поэтому их одноразовый токен не показан.
uk: Не вдалося безпечно зберегти вибір годинника Garmin, тому його одноразовий токен не показано.

source: The Internet connection appears to be offline.
ru: Похоже, что нет соединения с интернетом.
uk: Схоже, немає з’єднання з інтернетом.

source: The local backup is not valid JSON.
ru: Локальная резервная копия не является корректным JSON.
uk: Локальна резервна копія не є коректним JSON.

source: The local workout file belongs to another account.
ru: Локальный файл тренировок принадлежит другому аккаунту.
uk: Локальний файл тренувань належить іншому акаунту.

source: The network connection was lost.
ru: Сетевое соединение потеряно.
uk: Мережеве з’єднання втрачено.

source: The network request failed. Try again.
ru: Сетевой запрос не выполнен. Попробуй еще раз.
uk: Мережевий запит не виконано. Спробуй ще раз.

source: The note is too long.
ru: Заметка слишком длинная.
uk: Нотатка надто довга.

source: The recommendation engine adapts load, repetitions, and workout balance.
ru: Система рекомендаций адаптирует нагрузку, повторение и баланс тренировки.
uk: Система рекомендацій адаптує навантаження, повторення й баланс тренування.

source: The reported leaderboard profile does not exist.
ru: Профиля рейтинга, на который направлена жалоба, не существует.
uk: Профілю рейтингу, на який надіслано скаргу, не існує.

source: The request timed out.
ru: Время ожидания запроса истекло.
uk: Час очікування запиту минув.

source: The request was cancelled.
ru: Запрос отменен.
uk: Запит скасовано.

source: The selected Garmin watch binding is invalid. Select or pair the watch again.
ru: Привязка выбранных часов Garmin некорректна. Выбери или подключи часы снова.
uk: Прив’язка вибраного годинника Garmin некоректна. Вибери або сполучи годинник знову.

source: The server could not be reached.
ru: Не удалось связаться с сервером.
uk: Не вдалося зв’язатися із сервером.

source: The set no longer exists.
ru: Этого подхода больше не существует.
uk: Цього підходу більше не існує.

source: The workout changed before deletion. Review it and try again.
ru: Тренировка изменилась перед удалением. Проверь её и попробуй ещё раз.
uk: Тренування змінилося перед видаленням. Перевір його та спробуй ще раз.

source: The workout changed. Open similar exercises again.
ru: Тренировка изменилась. Откройте похожие упражнения ещё раз.
uk: Тренування змінилося. Відкрийте схожі вправи ще раз.

source: The workout is invalid: At least one exercise is required.
ru: Тренировка некорректна: нужно по крайней мере одно упражнение.
uk: Тренування некоректне: потрібна принаймні одна вправа.

source: The workout is invalid: Each exercise needs at least one set.
ru: Тренировка некорректна: каждое упражнение должно содержать по крайней мере один подход.
uk: Тренування некоректне: кожна вправа має містити принаймні один підхід.

source: The workout is invalid: The note is too long.
ru: Тренировка некорректна: заметка слишком длинная.
uk: Тренування некоректне: нотатка надто довга.

source: The workout may have been deleted.
ru: Возможно, тренировка была удалена.
uk: Можливо, тренування було видалено.

source: The workout no longer exists.
ru: Этой тренировки больше не существует.
uk: Цього тренування більше не існує.

source: These groups have not had meaningful work for 8+ days.
ru: Эти группы не получали заметной нагрузки более 8 дней.
uk: Ці групи не отримували помітного навантаження понад 8 днів.

source: Thirty-Day Streak
ru: Серия из тридцати дней
uk: Серія з тридцяти днів

source: This action requires a cloud account.
ru: Для этого действия требуется облачный аккаунт.
uk: Для цієї дії потрібен хмарний акаунт.

source: This also removes the exercise from saved workouts. Empty workouts are removed. This cannot be undone.
ru: Упражнение также будет удалено из сохраненных тренировок, а пустые тренировки – удалены. Это действие нельзя отменить.
uk: Вправу також буде видалено зі збережених тренувань, а порожні тренування — видалено. Цю дію не можна скасувати.

source: This backup belongs to another account.
ru: Эта резервная копия принадлежит другому аккаунту.
uk: Ця резервна копія належить іншому акаунту.

source: This cannot be undone. Export a backup first if you want to retain your workout history.
ru: Это действие нельзя отменить. Сначала экспортируй резервную копию, если хочешь сохранить историю тренировок.
uk: Цю дію не можна скасувати. Спочатку експортуй резервну копію, якщо хочеш зберегти історію тренувань.

source: This device only
ru: Только это устройство
uk: Лише цей пристрій

source: This exercise and all of its sets will be deleted from the workout. Undo is available briefly while you stay on this screen.
ru: Это упражнение и все его подходы будут удалены из тренировки. Отмена доступна в течение короткого времени, пока ты остаёшься на этом экране.
uk: Цю вправу та всі її підходи буде видалено з тренування. Скасування доступне протягом короткого часу, поки ти залишаєшся на цьому екрані.

source: This exercise is no longer available.
ru: Это упражнение больше недоступно.
uk: Ця вправа більше недоступна.

source: This invalidates the watch token and quarantines its pending plans. Reusing this watch with a new device ID requires resetting GymApp on the watch. Use token rotation instead when reconnecting the same watch.
ru: Это сделает токен часов недействительным и поместит ожидающие планы в карантин. Чтобы повторно использовать эти часы с новым идентификатором устройства, нужно сбросить GymApp на часах. Для повторного подключения тех же часов вместо этого смени токен.
uk: Це зробить токен годинника недійсним і перемістить його плани в очікуванні до карантину. Щоб повторно використати цей годинник із новим ідентифікатором пристрою, потрібно скинути GymApp на годиннику. Для повторного підключення того самого годинника натомість онови токен.

source: This is the final set for the exercise, so the exercise will also be deleted from the workout. Undo is available briefly while you stay on this screen.
ru: Это последний подход упражнения, поэтому упражнение также будет удалено из тренировки. Отмена доступна в течение короткого времени, пока ты остаёшься на этом экране.
uk: Це останній підхід вправи, тому вправу також буде видалено з тренування. Скасування доступне протягом короткого часу, поки ти залишаєшся на цьому екрані.

source: This is the final set in the workout, so the exercise and the entire workout will also be deleted. Undo is available briefly while you stay on this screen.
ru: Это последний подход в тренировке, поэтому упражнение и вся тренировка также будут удалены. Отмена доступна в течение короткого времени, пока ты остаёшься на этом экране.
uk: Це останній підхід у тренуванні, тому вправу й усе тренування також буде видалено. Скасування доступне протягом короткого часу, поки ти залишаєшся на цьому екрані.

source: This is the last exercise, so deleting it will also delete the entire workout. Undo is available briefly while you stay on this screen.
ru: Это последнее упражнение, поэтому вместе с ним будет удалена вся тренировка. Отмена доступна в течение короткого времени, пока ты остаёшься на этом экране.
uk: Це остання вправа, тому разом із нею буде видалено все тренування. Скасування доступне протягом короткого часу, поки ти залишаєшся на цьому екрані.

source: This leaderboard profile is no longer available.
ru: Этот профиль рейтинга больше недоступен.
uk: Цей профіль рейтингу більше недоступний.

source: this profile
ru: этот профиль
uk: цей профіль

source: This profile keeps workouts on this device and does not synchronize protected progress.
ru: Этот профиль хранит тренировки на этом устройстве и не синхронизирует защищённый прогресс.
uk: Цей профіль зберігає тренування на цьому пристрої та не синхронізує захищений прогрес.

source: This removes the workout and every set. This action cannot be undone.
ru: Тренировка и все её подходы будут удалены. Это действие нельзя отменить.
uk: Тренування та всі його підходи буде видалено. Цю дію не можна скасувати.

source: This sign-in link was not requested on this device or has expired. Start the flow again.
ru: Эта ссылка для входа не была запрошена на этом устройстве или срок её действия истёк. Начни процесс заново.
uk: Це посилання для входу не запитували на цьому пристрої або воно протерміноване. Почни процес знову.

source: This watch changed elsewhere. Its details were refreshed; review the selection and retry token rotation.
ru: Эти часы изменены в другом месте. Их данные обновлены; проверь выбор и повтори смену токена.
uk: Цей годинник змінено деінде. Його дані оновлено; перевір вибір і повтори ротацію токена.

source: This workout moved your exercise history forward.
ru: Эта тренировка улучшила твою историю упражнений.
uk: Це тренування покращило твою історію вправ.

source: This workout queue request conflicts with an earlier submission and was not duplicated.
ru: Этот запрос в очередь тренировок конфликтует с предыдущим и не был продублирован.
uk: Цей запит до черги тренувань конфліктує з попереднім і не був продубльований.

source: Title
ru: Звание
uk: Звання

source: Too many emails were requested. Try again later.
ru: Запрошено слишком много писем. Попробуй позже.
uk: Запитано забагато листів. Спробуй пізніше.

source: Top muscle
ru: Главная мышца
uk: Головний м’яз

source: Top rank
ru: Самый высокий ранг
uk: Найвищий ранг

source: Total Reps
ru: Всего повторений
uk: Усього повторів

source: total set count
ru: общее количество подходов
uk: загальна кількість підходів

source: Total Sets
ru: Всего подходов
uk: Усього підходів

source: Total volume
ru: Общий объем
uk: Загальний обсяг

source: Total Volume
ru: Общий объем
uk: Загальний обсяг

source: Total XP
ru: Всего XP
uk: Усього XP

source: TOTAL XP
ru: ВСЕГО XP
uk: УСЬОГО XP

source: Touch three different exercise entries today.
ru: Выполни сегодня три разных упражнения.
uk: Виконай сьогодні три різні вправи.

source: Track consistency, output and intensity at a glance.
ru: Оцени регулярность, объем и интенсивность одним взглядом.
uk: Оціни регулярність, обсяг та інтенсивність одним поглядом.

source: Train 3 exercises
ru: Выполни 3 упражнения
uk: Виконай 3 вправи

source: Train on 3 days
ru: Тренируйся 3 дня
uk: Тренуйся 3 дні

source: Training metrics
ru: Показатели тренировки
uk: Показники тренування

source: Triceps Pushdown
ru: Разгибание рук на блоке

source: Try a different filter.
ru: Попробуйте другой фильтр.

source: Try again
ru: Попробовать еще раз

source: Try another name or clear the filters.
ru: Попробуй другое название или очисти фильтры.
uk: Спробуй іншу назву або очисть фільтри.

source: Try another name or clear the search.
ru: Попробуй другое название или очисти поиск.
uk: Спробуй іншу назву або очисть пошук.

source: Turn off notifications
ru: Выключить уведомления
uk: Вимкнути сповіщення

source: Turn on notifications
ru: Включить уведомления
uk: Увімкнути сповіщення

source: Type DELETE exactly to enable permanent deletion.
ru: Введи DELETE без ошибок, чтобы разрешить окончательное удаление.
uk: Введи DELETE без помилок, щоб дозволити остаточне видалення.

source: Unbroken
ru: Непрерывный
uk: Неперервний

source: Uncommon
ru: Необычная
uk: Незвичайна

source: Undo
ru: Отменить
uk: Скасувати

source: Unknown
ru: Неизвестно
uk: Невідомо

source: Unknown error
ru: Неизвестная ошибка
uk: Невідома помилка

source: Unlocked
ru: Открыто
uk: Відкрито

source: Unlocked collection
ru: Открытая коллекция
uk: Відкрита колекція

source: Update password
ru: Обновить пароль
uk: Оновити пароль

source: Update the name or enter every selectable load shown on this machine.
ru: Измени название или укажи все доступные нагрузки этого тренажёра.
uk: Зміни назву або вкажи всі доступні навантаження цього тренажера.

source: Updating…
ru: Обновление…
uk: Оновлення…

source: Uploads the current workout backup and profile statistics
ru: Загрузка текущей резервной копии тренировок и статистики профиля
uk: Завантажує поточну резервну копію тренувань і статистику профілю

source: Upper
ru: Верх
uk: Верх

source: Upper / Lower
ru: Верх / Низ
uk: Верх / Низ

source: Upper body
ru: Верх тела

source: Upright Row
ru: Тяга штанги к подбородку

source: Use a clear name you will recognize while logging workouts.
ru: Используй понятное название, которое легко узнать при записи тренировки.
uk: Використай зрозумілу назву, яку легко впізнати під час запису тренування.

source: Use a different address
ru: Использовать другой адрес
uk: Використати іншу адресу

source: Use Add workout when you are ready to log your first session.
ru: Нажми «Добавить тренировки», когда будешь готов записать первую сессию.
uk: Натисни «Додати тренування», коли будеш готовий записати першу сесію.

source: Use at least 12 characters (up to 72 UTF-8 bytes) with lowercase and uppercase Latin letters, a number, and a supported symbol such as !, @, #, or $.
ru: Используй не менее 12 символов (до 72 байт UTF-8): строчную и заглавную латинские буквы, цифру и поддерживаемый спецсимвол, например !, @, # или $.
uk: Використай щонайменше 12 символів (до 72 байтів UTF-8): малу й велику латинські літери, цифру та підтримуваний спецсимвол, наприклад !, @, # або $.

source: Use automatic
ru: Автоматически
uk: Автоматично

source: Use exact machine weights
ru: Использовать точные веса тренажёра
uk: Використовувати точні ваги тренажера

source: Use Export backup on the Exercises screen before replacing or resetting this device.
ru: Перед заменой или сбросом этого устройства воспользуйся «Экспортом копии» на экране упражнений.
uk: Скористайся «Експортувати копію» на екрані вправ перед заміною або скиданням цього пристрою.

source: Use Last, Previous, Copy, or +2.5 for faster logging.
ru: Для более быстрой записи используй «Последняя», «Предыдущая», «Копировать» или +2,5.
uk: Для швидшого запису використовуй «Остання», «Попередня», «Копіювати» або +2,5.

source: Use suggestion
ru: Использовать предложение
uk: Використати пропозицію

source: Use this exercise
ru: Использовать это упражнение
uk: Використати цю вправу

source: Use token rotation to reconnect the same watch. It preserves the device ID already pinned by the Garmin app.
ru: Чтобы повторно подключить те же часы, смени токен. Это сохранит идентификатор устройства, уже закреплённый приложением Garmin.
uk: Щоб повторно підключити той самий годинник, онови токен. Це збереже ідентифікатор пристрою, уже закріплений застосунком Garmin.

source: User ID
ru: ID пользователя
uk: ID користувача

source: Uses your split, recent fatigue, neglected muscles, and progressive overload history.
ru: Использует твой сплит, недавнюю усталость, заброшенные мышцы и историю прогрессивной нагрузки.
uk: Використовує твій спліт, недавню втому, занедбані м’язи й історію прогресивного навантаження.

source: UTF-8 encoding failed.
ru: Ошибка кодирования UTF-8.
uk: Помилка кодування UTF-8.

source: V-Bar Triceps Pushdown
ru: Разгибание рук на блоке с V-рукояткой

source: Verification code
ru: Код подтверждения
uk: Код підтвердження

source: Verification code sent. Re-enter the new password with the code.
ru: Код подтверждения отправлен. Повторно введи новый пароль вместе с кодом.
uk: Код підтвердження надіслано. Повторно введи новий пароль разом із кодом.

source: Version
ru: Версия
uk: Версія

source: Veteran
ru: Ветеран
uk: Ветеран

source: View ranks
ru: Посмотреть ранги
uk: Переглянути ранги

source: Volume
ru: Объём
uk: Обсяг

source: Volume Maker
ru: Создатель объема
uk: Творець обсягу

source: Warm Up
ru: Разминка

source: Watch name
ru: Название часов
uk: Назва годинника

source: We sent a confirmation link to the address below. Open the newest email from GymApp and tap “Confirm email”. Then return to GymApp and sign in.
ru: Мы отправили ссылку для подтверждения на адрес ниже. Откройте последнее письмо от GymApp и нажмите «Подтвердить email». Затем вернитесь в GymApp и войдите.
uk: Ми надіслали посилання для підтвердження на адресу нижче. Відкрийте найновіший лист від GymApp і натисніть «Підтвердити email». Потім поверніться до GymApp та увійдіть.

source: Week
ru: Неделя
uk: Тиждень

source: Week streak
ru: Серия недель
uk: Серія тижнів

source: Weekly
ru: Недельные

source: Weight
ru: Вес
uk: Вага

source: Weight must be a finite non-negative number.
ru: Вес должен быть конечным неотъемлемым числом.
uk: Вага має бути скінченним невід’ємним числом.

source: Weight must be a non-negative number.
ru: Вес должен быть неотъемлемым числом.
uk: Вага має бути невід’ємним числом.

source: Weight PR
ru: Рекорд веса
uk: Рекорд ваги

source: Weighted Crunch
ru: Скручивание с диском

source: Weighted Side Bend
ru: Боковые наклоны с отягощением

source: Welcome back
ru: С возвращением
uk: З поверненням

source: Work out on three separate days this week.
ru: Тренируйся в три разных дня этой недели.
uk: Тренуйся у три різні дні цього тижня.

source: Workhorse
ru: Трудяга
uk: Трудяга

source: Workout
ru: Тренировка
uk: Тренування

source: Workout changes sync automatically while you are signed in.
ru: Изменения тренировок синхронизируются автоматически, пока ты в аккаунте.
uk: Зміни тренувань синхронізуються автоматично, доки ти в акаунті.

source: Workout complete
ru: Тренировка завершена
uk: Тренування завершено

source: Workout data
ru: Данные тренировок
uk: Дані тренувань

source: Workout data could not be saved: Application Support is unavailable.
ru: Не удалось сохранить данные тренировок: каталог Application Support недоступен.
uk: Не вдалося зберегти дані тренувань: каталог Application Support недоступний.

source: Workout data could not be saved: UTF-8 encoding failed.
ru: Не удалось сохранить данные тренировок: ошибка кодировки UTF-8.
uk: Не вдалося зберегти дані тренувань: помилка кодування UTF-8.

source: Workout data is handled under the Privacy Policy.
ru: Данные тренировок обрабатываются согласно Политике конфиденциальности.
uk: Дані тренувань обробляються відповідно до Політики конфіденційності.

source: Workout data is stored on this device. Export a backup before changing devices.
ru: Данные тренировок хранятся на этом устройстве. Перед изменением устройства экспортируй резервную копию.
uk: Дані тренувань зберігаються на цьому пристрої. Перед зміною пристрою експортуй резервну копію.

source: Workout date
ru: Дата тренировки
uk: Дата тренування

source: Workout deleted.
ru: Тренировка удалена.
uk: Тренування видалено.

source: Workout detail
ru: Детали тренировки
uk: Деталі тренування

source: Workout details updated.
ru: Детали тренировки обновлены.
uk: Деталі тренування оновлено.

source: Workout saved and queued for Garmin.
ru: Тренировка сохранена и добавлена в очередь Garmin.
uk: Тренування збережено й додано до черги Garmin.

source: Workout saved.
ru: Тренировка сохранена.
uk: Тренування збережено.

source: Workout section
ru: Раздел тренировок
uk: Розділ тренувань

source: Workout unavailable
ru: Тренировка недоступна
uk: Тренування недоступне

source: Workouts
ru: Тренировки
uk: Тренування

source: Workouts per week
ru: Тренировок в неделю
uk: Тренувань на тиждень

source: You already reported this display name.
ru: Ты уже жаловался на это отображаемое имя.
uk: Ти вже скаржився на це відображуване ім’я.

source: You will first confirm the warning, then type DELETE before anything is removed.
ru: Сначала подтверди предупреждение, а затем введи DELETE. До этого ничего не будет удалено.
uk: Спочатку підтвердь попередження, а потім введи DELETE. До цього нічого не буде видалено.

source: Your badge collection
ru: Твоя коллекция значков
uk: Твоя колекція відзнак

source: Your data
ru: Твои данные
uk: Твої дані

source: Your exercises
ru: Твои упражнения
uk: Твої вправи

source: Your recovery link was verified. Set a new password for this account.
ru: Ссылка на восстановление подтверждена. Установите новый пароль для этого аккаунта.
uk: Посилання для відновлення підтверджено. Встанови новий пароль для цього акаунта.

source: Your session expired. Sign in again.
ru: Срок действия сеанса истёк. Войдите снова.
uk: Термін дії сеансу минув. Увійдіть знову.

source: Your training history and next best move.
ru: Твоя история тренировок и следующий лучший шаг.
uk: Твоя історія тренувань і найкращий наступний крок.

# Z%lld %lld%@
source: Z%1$lld %2$lld%3$@
ru: З%1$lld %2$lld%3$@

source: Мова
ru: Язык

source: English
uk: Англійська
